src/Catalogs/ВидыОповещенийКлиентам/ВидыОповещенийКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОповещенийКлиентам</name>
  <attributes>
    <name>ГруппаРассылокИОповещений</name>
    <type>
      <types>CatalogRef.ГруппыРассылокИОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредназначенаДляЭлектронныхПисем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредназначенаДляSMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщенияSMS</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭлектронногоПисьма</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяУсловиеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытийОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыУсловия</name>
    <attributes>
      <name>ЭтоПараметрПредущегоСообщения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВидыОповещенийКлиентам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ПредназначенаДляЭлектронныхПисем И Не ПредназначенаДляSMS Тогда
		
		ТекстОшибки = НСтр("ru='Не указан ни один вид доставки сообщений.';uk='Не зазначений жоден вид доставки повідомлень.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ПредназначенаДляЭлектронныхПисем",
			,
			Отказ);
		
	КонецЕсли;
	
	Если Не ПредназначенаДляSMS Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ШаблонСообщенияSMS");
	КонецЕсли;
	
	Если НЕ ПредназначенаДляЭлектронныхПисем Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ШаблонЭлектронногоПисьма");
	КонецЕсли;
	
	Если Не ИспользуетсяУсловиеОтправки Тогда
		МассивНепроверяемыхРеквизитов.Добавить("УсловиеОтправки");
	КонецЕсли;
		

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныеЗаданияСервер.УдалитьЗадание(РегламентноеЗадание);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	// Создание регламентное задание (получение уникального идентификатора)
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИспользуетсяУсловиеОтправки Тогда
		
		ЗаполнитьПараметрыУсловия(ПараметрыУсловия, УсловиеОтправки);
		
	Иначе
		
		УсловиеОтправки = "";
		ПараметрыУсловия.Очистить();
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Расписание") И ДополнительныеСвойства.Свойство("Использование") Тогда
		
		Задание = РегламентныеЗаданияСервер.Задание(РегламентноеЗадание);
		Если Задание = Неопределено  Тогда
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.АнализДанныхДляОповещенийКлиентам);
			ПараметрыЗадания.Вставить("Использование", Ложь);
			ПараметрыЗадания.Вставить("Наименование", НаименованиеРегламентногоЗадания());
			Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			
			РегламентноеЗадание = РегламентныеЗаданияСервер.УникальныйИдентификатор(Задание);
			
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("Задание",Задание);
		
	ИначеЕсли ДополнительныеСвойства.Свойство("УдалениеРегламентногоЗадания") Тогда
		
		РегламентныеЗаданияСервер.УдалитьЗадание(РегламентноеЗадание);
		РегламентноеЗадание = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗаписьРегламентногоЗадания();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РегламентноеЗадание = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьЗаписьРегламентногоЗадания()

	Если НЕ ДополнительныеСвойства.Свойство("Задание") Тогда
		Возврат;
	КонецЕсли;
	
	Задание = ДополнительныеСвойства.Задание;
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура;
	
	//Расписание устанавливается в форме элемента
	Если ДополнительныеСвойства.Свойство("Расписание") 
			И ТипЗнч(ДополнительныеСвойства.Расписание) = Тип("РасписаниеРегламентногоЗадания")
			И Строка(ДополнительныеСвойства.Расписание) <> Строка(Задание.Расписание) Тогда
			
		ПараметрыЗадания.Вставить("Расписание", ДополнительныеСвойства.Расписание);
		
	КонецЕсли;
	
	// Использование устанавливается в форме элемента
	Если ПометкаУдаления И Задание.Использование Тогда
		
		ПараметрыЗадания.Вставить("Использование", Ложь);
		
	ИначеЕсли ДополнительныеСвойства.Свойство("Использование") 
		И ДополнительныеСвойства.Использование <> Задание.Использование Тогда
		
		ПараметрыЗадания.Вставить("Использование", ДополнительныеСвойства.Использование);
		
	КонецЕсли;

	НаименованиеЗадания = НаименованиеРегламентногоЗадания();
	ПараметрыЗадания.Вставить("Наименование", НаименованиеЗадания);
	
	Параметры = Новый Массив;
	Параметры.Добавить(Ссылка);
	ПараметрыЗадания.Вставить("Параметры", Параметры);
	
	УстановитьПривилегированныйРежим(Истина);
	РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, ПараметрыЗадания);
	
КонецПроцедуры

Функция НаименованиеРегламентногоЗадания()

	Возврат НСтр("ru='Анализ данных для вида оповещений';uk='Аналіз даних для виду сповіщень'") + ": " + СокрЛП(Наименование);

КонецФункции 

Процедура ЗаполнитьПараметрыУсловия(ПараметрыУсловия, УсловиеОтправки)
	
	ПараметрыУсловия.Очистить();
	
	СоответствиеПараметровУсловия = ШаблоныСообщенийКлиентСервер.ПолучитьПараметрыТекстаСообщения(УсловиеОтправки);
	ПараметрыПредыущегоСообщения = СоответствиеПараметровУсловия.Получить("ПредыдущееСообщение");
	Если ПараметрыПредыущегоСообщения <> Неопределено Тогда
		Для Каждого Параметр Из ПараметрыПредыущегоСообщения Цикл
			НоваяСтрока = ПараметрыУсловия.Добавить();
			НоваяСтрока.ЭтоПараметрПредущегоСообщения = Истина;
			НоваяСтрока.ИмяПараметра = Параметр;
		КонецЦикла;
	КонецЕсли;
	ПараметрыПредыущегоСообщения = СоответствиеПараметровУсловия.Получить("ТекущееСообщение");
	Если ПараметрыПредыущегоСообщения <> Неопределено Тогда
		Для Каждого Параметр Из ПараметрыПредыущегоСообщения Цикл
			НоваяСтрока = ПараметрыУсловия.Добавить();
			НоваяСтрока.ЭтоПараметрПредущегоСообщения = Ложь;
			НоваяСтрока.ИмяПараметра = Параметр;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры;

#КонецОбласти

#КонецЕсли
